Revit.Elements.AdaptiveComponent
A Revit Adaptive Component

Revit.Elements.AdaptiveComponent.#ctor(Autodesk.DesignScript.Geometry.Point[],Revit.Elements.FamilySymbol)
Internal constructor for the AdaptiveComponent wrapper
pts: Points to use as reference
fs: FamilySymbol to place

Revit.Elements.AdaptiveComponent.#ctor(System.Double[][],Revit.GeometryReferences.ElementFaceReference,Revit.Elements.FamilySymbol)
Internal constructor for the AdaptiveComponent wrapper
pts: Points to use as reference
f: Face to use as reference
fs: FamilySymbol to place

Revit.Elements.AdaptiveComponent.#ctor(System.Double[],Autodesk.Revit.DB.Reference,Revit.Elements.FamilySymbol)
Internal constructor for the AdaptiveComponent wrapper
params: Params on curve to reference
c: Curve to use as reference
fs: FamilySymbol to place

Revit.Elements.AdaptiveComponent.#ctor(Autodesk.Revit.DB.FamilyInstance)
Internal constructor for existing Elements.
familyInstance:

Revit.Elements.AdaptiveComponent.InitAdaptiveComponent(Autodesk.DesignScript.Geometry.Point[],Revit.Elements.FamilySymbol)
Initialize an AdaptiveComponent element
pts: Points to use as reference
fs: FamilySymbol to place

Revit.Elements.AdaptiveComponent.InitAdaptiveComponent(System.Double[][],Revit.GeometryReferences.ElementFaceReference,Revit.Elements.FamilySymbol)
Initialize an AdaptiveComponent element
pts: Points to use as reference
f: Face to use as reference
fs: FamilySymbol to place

Revit.Elements.AdaptiveComponent.InitAdaptiveComponent(System.Double[],Autodesk.Revit.DB.Reference,Revit.Elements.FamilySymbol)
Initialize an AdaptiveComponent element
parms: Params on curve to reference
c: Curve to use as reference
fs: FamilySymbol to place

Revit.Elements.AdaptiveComponent.InitAdaptiveComponent(Autodesk.Revit.DB.FamilyInstance)
Initialize an AdaptiveComponent element
familyInstance:

Revit.Elements.AdaptiveComponent.InternalSetFamilySymbol(Revit.Elements.FamilySymbol)
Set the family symbol for the internal family instance
fs:

Revit.Elements.AdaptiveComponent.InternalSetPositions(Autodesk.Revit.DB.XYZ[])
Set the positions of the internal family instance from a list of XYZ points
points:

Revit.Elements.AdaptiveComponent.InternalSetUvsAndFace(Autodesk.Revit.DB.UV[],Autodesk.Revit.DB.Reference)
Set the positions of the InternalFamilyInstace from an array of uvs
uvs:
faceReference:

Revit.Elements.AdaptiveComponent.InternalSetParamsAndCurve(System.Double[],Autodesk.Revit.DB.Reference)
Set the positions of the InternalFamilyInstace from an array of parameters and curve
parms:
c:

Revit.Elements.AdaptiveComponent.ByPoints(Autodesk.DesignScript.Geometry.Point[],Revit.Elements.FamilySymbol)
Create an AdaptiveComponent from a list of points.
points: The points to reference in the AdaptiveComponent
familySymbol: The family symbol to use to build the AdaptiveComponent
Returns:

Revit.Elements.AdaptiveComponent.ByParametersOnFace(Autodesk.DesignScript.Geometry.UV[],Autodesk.DesignScript.Geometry.Surface,Revit.Elements.FamilySymbol)
Create an adaptive component by uv points on a face.
uvs: An array of UV pairs
surface: The surface on which to place the AdaptiveComponent
familySymbol:
Returns:

Revit.Elements.AdaptiveComponent.ByParametersOnCurveReference(System.Double[],Autodesk.DesignScript.Geometry.Curve,Revit.Elements.FamilySymbol)
Create an adaptive component referencing the parameters on a Curve reference
parameters: The parameters on the curve
curve: The curve to reference
familySymbol: The family symbol to construct
Returns:

Revit.Elements.AdaptiveComponent.FromExisting(Autodesk.Revit.DB.FamilyInstance,System.Boolean)
Construct from an existing instance of an AdaptiveComponent.
familyInstance:
isRevitOwned:
Returns: